#pragma once
#include "types.h"

using namespace types;

namespace vocab {
    const Vec<String> LOWER_CHARS = {
        "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", 
        "à", "á", "ã", "ạ", "ả", "â", "ấ", "ầ", "ẩ", "ẫ", "ậ", "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ", 
        "ò", "ó", "ọ", "ỏ", "õ", "ô", "ố", "ồ", "ổ", "ỗ", "ộ", "ơ", "ớ", "ờ", "ở", "ỡ", "ợ", 
        "è", "é", "ẹ", "ẻ", "ẽ", "ê", "ế", "ề", "ể", "ễ", "ệ", 
        "ù", "ú", "ũ", "ụ", "ủ", "ư", "ứ", "ừ", "ử", "ữ", "ự", 
        "ì", "í", "ĩ", "ỉ", "ị", "ý", "ỳ", "ỵ", "ỷ", "ỹ"
    };

    const Vec<String> UPPER_CHARS = {
        "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", 
        "À", "Á", "Ã", "Ạ", "Ả", "Â", "Ấ", "Ầ", "Ẩ", "Ẫ", "Ậ", "Ă", "Ắ", "Ằ", "Ẳ", "Ẵ", "Ặ", 
        "Ò", "Ó", "Ọ", "Ỏ", "Õ", "Ô", "Ố", "Ồ", "Ổ", "Ỗ", "Ộ", "Ơ", "Ớ", "Ờ", "Ở", "Ỡ", "Ợ", 
        "È", "É", "Ẹ", "Ẻ", "Ẽ", "Ê", "Ế", "Ề", "Ể", "Ễ", "Ệ", 
        "Ù", "Ú", "Ũ", "Ụ", "Ủ", "Ư", "Ứ", "Ừ", "Ử", "Ữ", "Ự", 
        "Ì", "Í", "Ĩ", "Ỉ", "Ị", "Ý", "Ỳ", "Ỵ", "Ỷ", "Ỹ"
    };

    const Vec<String> DIGITS = {
        "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"
    };

    String SPACE = " ";

    String COMMA = ",";

    String STOP = ".";

    String COLON = ":";

    const Vec<String> PUNCTUATIONS = {};
    
    const Vec<String> BRACES = {};
}